Revit 2024 API
BuiltInFailures.PointFailures.CannotMakePointHostedByIntersection Property
 Cannot make point hosted by intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMakePointHostedByIntersection { get; }
Visual Basic
Public Shared ReadOnly Property CannotMakePointHostedByIntersection As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMakePointHostedByIntersection {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace